【零号基地90】华登区块狗运营级/2003291/app/common/models/Admin.php

SELECT * FROM `me_admin` WHERE (`id`=13) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);