【零号基地90】华登区块狗运营级/2003291/app/common/models/TradeNum.php

SELECT `areaid`, `areaname`, `min`, `max` FROM `me_trade_num`
---
    public static function getAreaNum() {
        $ret = TradeNum::find()->select('areaid, areaname, min, max')->asArray()->all();