【零号基地90】华登区块狗运营级/2003291/app/common/models/UserWalletRecord.php

    public static function insertrecord($userid,$amount,$event_type,$pay_type,$wallet_type,$wallet_amount,$note){
        $Record = new UserWalletRecord();
        $Record->userid = $userid;                               // 用户id
        $Record->amount = $amount;                               // 发生金额
        $Record->event_type = $event_type;                       // 事件类型
        $Record->pay_type = $pay_type;                           // 交易类型
        $Record->wallet_type = $wallet_type;                     // 钱包类型
        $Record->wallet_amount = $wallet_amount;                 // 钱包总额
        $Record->note = $note;                                   // 备注
        $Record->created_at = time();                            // 创建时间
        $Record->updated_at = time();                            // 更新时间
//        $Record->ip = Yii::$app->getRequest()->getUserIP();
        $Record->ip = Yii::$app->getRequest()->getUserIP();
        return $Record->save();
---
INSERT INTO `me_user_wallet_record` (`userid`, `amount`, `event_type`, `pay_type`, `wallet_type`, `wallet_amount`, `note`, `created_at`, `updated_at`, `ip`) VALUES (58, '1001', 11, 2, 3, '0', '后台发布宠物,扣除推广收益', 1583237620, 1583237620, '113.86.206.67')