【零号基地90】华登区块狗运营级/2003291/app/common/models/UserZodiac.php

    public static function getlist(){
        $search = Yii::$app->request->get("search");
        $allow_rack = Yii::$app->request->get("allow_rack");
        $is_rack = Yii::$app->request->get("is_rack");

        $query = self::find()->orderBy("created_at desc");
        if ($allow_rack != '') {
            $query->andFilterWhere(["=","allow_rack",$allow_rack]);
        }
        if ($is_rack != '') {
            $query->andFilterWhere(["=","is_rack",$is_rack]);
        }
        if ($search != '') {
            $query->andFilterWhere(["=","userid",$search]);
            $query->orFilterWhere(["like","username",$search]);
        }
        $countQuery = clone $query;
        $offset = Yii::$app->request->get("offset");
        $limit = Yii::$app->request->get("limit");
        $totalCount = $countQuery->count();
        $res = $query->offset($offset)->limit($limit)->asArray()->all();
---
SELECT * FROM `me_user_zodiac` ORDER BY `created_at` DESC LIMIT 10