【零号基地90】华登区块狗运营级/2003291/app/common/models/Zodiac.php

    public static function getlist(){
        $query = self::find()->orderBy("created_at asc");
        $countQuery = clone $query;
        $offset = Yii::$app->request->get("offset");
        $limit = Yii::$app->request->get("limit");
        $totalCount = $countQuery->count();
        $res = $query->offset($offset)->limit($limit)->asArray()->all();
---
SELECT * FROM `me_zodiac` ORDER BY `created_at` LIMIT 10

    public static function createData($id = null) {
        $model = $id ? self::findOne($id) : new self();
---
SELECT * FROM `me_zodiac` WHERE `id`='4'