【零号基地90】华登区块狗运营级/2003291/app/common/models/ZodiacIssue.php

SELECT * FROM `me_zodiac_issue` WHERE issel = 0 ORDER BY `id` DESC LIMIT 10
---
    public static function getlist(){
        $query = self::find()->where('issel = 0')->orderBy("id desc");
        $countQuery = clone $query;
        $offset = Yii::$app->request->get("offset");
        $limit = Yii::$app->request->get("limit");
        $totalCount = $countQuery->count();
        $res = $query->offset($offset)->limit($limit)->all();