【零号基地90】华登区块狗运营级/2003291/app/backend/views/zodiac/release.php

use common\models\Zodiac;
use common\models\ZodiacGrade;

$zodiac = Zodiac::find()->select('id,name')->asArray()->all();
---
SELECT `id`, `name` FROM `me_zodiac`