【零号基地90】华登区块狗运营级/2003291/app/backend/controllers/RegistController.php

    public function actionAjaxlist() {

        $res = MY_User::getList();

        $temp = ["total" => $res["total"], "rows" => []];

        if ($res["total"] > 0) {
            foreach ($res["data"] as $item) {
                $refer = \common\models\User::find()->andWhere(["=","mycode",$item['invite_code']])->one();
                //获取用户profile表
                $userprofile = UserProfile::find()->where('userid = :id',[':id'=>$item['id']])->one();
                //获取累计收益
                $total_award1 = UserZodiac::find()->where('userid = :id',[':id'=>$item['id']])->sum('hcg');
                $total_award2 = UserZodiac::find()->where('userid = :id',[':id'=>$item['id']])->sum('old_hcg');
                $total_award = $total_award1 - $total_award2;
                $userbank = BankRealname::find()->where('userid = :id',[':id'=>$item['id']])->one();
---
SELECT * FROM `me_user` WHERE `mycode` = 'CUR8Sc'
SELECT * FROM `me_user_profile` WHERE userid = '106'
SELECT SUM(hcg) FROM `me_user_zodiac` WHERE userid = '106'
SELECT SUM(old_hcg) FROM `me_user_zodiac` WHERE userid = '106'
SELECT * FROM `me_bank_realname` WHERE userid = '106'

    public function actionAjaxamounttrade() {
        $res = \common\models\UserAmountTrade::getList();
        $temp = ["total" => $res["total"], "rows" => []];
        if ($res["total"] > 0) {
            foreach ($res["data"] as $item) {
                if($item['status'] != 50) {
                    if ($item['status'] == 8) {      // 卖家申诉中
                        $action = MTools::getStringActions(["overtimeop" => ["params" => ["id" => $item["id"], "status" => $item['status']], "title" => "卖家申诉处理"]]);
                        $action3 = MTools::getStringActions(["overtimeop" => ["params" => ["id" => $item["id"], "status" => 6, "finishorder" => 1], "title" => "完结订单"]]);
                    } elseif ($item['status'] == 0 || $item['status'] == 1 || $item['status'] == 7) {  // 挂单、买家已下单、卖家已下单
                        $action = '-';
                        $action2 = MTools::getStringActions(["overtimeop" => ["params" => ["id" => $item["id"], "status" => $item['status'], "iscancel" => 1], "title" => "撤销"]]);
                        $action3 = '-';
                    } elseif ($item['status'] == 2) {
                        $action = '-';
                        $action2 = MTools::getStringActions(["overtimeop" => ["params" => ["id" => $item["id"], "status" => $item['status'], "iscancel" => 1], "title" => "撤销"]]);
                        $action3 = MTools::getStringActions(["overtimeop" => ["params" => ["id" => $item["id"], "status" => 6, "finishorder" => 1], "title" => "完结订单"]]);
                    } elseif ($item['status'] == 3 || $item['status'] == 4 || $item['status'] == 9 || $item['status'] == 10) {
                        $action = '-';
                        $action2 = '-';
                        $action3 = '-';
                    }
                    $buyer = \common\models\UserProfile::find()->where("userid=:userid", [":userid" => $item["in_userid"]])->asArray()->one();
---
SELECT * FROM `me_user_profile` WHERE userid='40'

    public function actionOvertimeop() {
        $id = Yii::$app->request->get('id');
        $status = Yii::$app->request->get('status');
        $iscancel = Yii::$app->request->get('iscancel');
        $finishorder = Yii::$app->request->get('finishorder')?Yii::$app->request->get('finishorder'):100; // 是否后台完结订单
        $buyeruntradelimit = MTools::getYiiParams('buyeruntradelimit') ? MTools::getYiiParams('buyeruntradelimit') : 1 ;         // 买家未付款次数


        // 获取订单
        $order = \common\models\UserAmountTrade::find()->where('id=:id', [':id' => $id])->one();

        // 买家
        $inuser = \common\models\User::find()->where('id=:id', [':id' => $order->in_userid])->one();

        // 获取宠物发布表信息
        $zodiac_issue = \common\models\ZodiacIssue::find()->where('id=:id', [':id' => $order->areaid])->one();
---
SELECT * FROM `me_user_amount_trade` WHERE id='2'
SELECT * FROM `me_user` WHERE id=40
SELECT * FROM `me_zodiac_issue` WHERE id=5

                    //更改宠物产品状态
                    $zodiac_issue->issel = 0;
                    // $ss = SnapJudgment::findOne($zodiac_issue->id);
                    $ss = SnapJudgment::find()->where("issue_id = :issue_id and userid = :userid",[":issue_id"=>$zodiac_issue->id,':userid'=>$order->in_userid])->one();
                    $ss->issue_id = $ss->userid.'_'.time();
                }
                if($modified == 1) {
                    if ($order->save() && $zodiac_issue->save() && $order->save() && $ss->save()) {
---
SELECT * FROM `me_snap_judgment` WHERE issue_id = 5 and userid = 40
UPDATE `me_zodiac_issue` SET `issel`=0 WHERE `id`=5