【零号基地90】华登区块狗运营级/2003291/app/backend/controllers/SiteController.php

SELECT SUM(amount) FROM `me_user_wallet_record` WHERE event_type=1 and pay_type=1 and wallet_type=1
SELECT SUM(amount) FROM `me_user_wallet_record` WHERE event_type=2 and pay_type=2 and wallet_type=1
SELECT SUM(hcg_wa) FROM `me_user_wallet`
SELECT COUNT(*) FROM `me_user` WHERE created_at >= 1583164800 && created_at < 1583251199
SELECT COUNT(*) FROM `me_user_amount_trade` WHERE status = 3
SELECT SUM(amount) FROM `me_user_amount_trade` WHERE status = 3
SELECT SUM(amount) FROM `me_user_wallet_record` WHERE (event_type=6 || event_type=9) && pay_type=2 and wallet_type=1
SELECT SUM(amount) FROM `me_user_wallet_record` WHERE event_type = 10 and pay_type = 1 and wallet_type = 1
SELECT SUM(amount) FROM `me_user_wallet_record` WHERE event_type=8 && pay_type=2 and wallet_type=1
---
    public function actionIndex() {
        if (Yii::$app->user->isGuest) {
            $this->redirect(["login"]);
        } else {
            // 拨发量
            $lubao_in = UserWalletRecord::find()->where('event_type=1 and pay_type=1 and wallet_type=1')->sum('amount');

            $lubao_out = UserWalletRecord::find()->where('event_type=2 and pay_type=2 and wallet_type=1')->sum('amount');

            $lubao = $lubao_in - $lubao_out;

            // 持币量
            $user_lubao = UserWallet::find()->sum('hcg_wa');

            // 注册会员数量显示
            $beginToday = mktime(0,0,0,date('m'),date('d'),date('Y'));// 今日开始时间戳
            $endToday = mktime(0,0,0,date('m'),date('d')+1,date('Y'))-1; // 今日结束时间戳
            $registNum = User::find()->where('created_at >= :beginTime && created_at < :endTime',[':beginTime' => $beginToday,':endTime' => $endToday])->count(); // 今日注册的会员数量

            // 交易数量统计
            $TotalNum = UserAmountTrade::find()->where('status = 3')->count();// 总交易成功数量
            $buyNum =  UserAmountTrade::find()->where('status = 3')->sum('amount');// 成交价格
            $buyNum = $buyNum === null ? 0 : $buyNum;
            $income_service =  UserWalletRecord::find()->where('(event_type=6 || event_type=9) && pay_type=2 and wallet_type=1')->sum('amount');          //预约/抢购收入
            $income_service = $income_service === null ? 0 : $income_service;
            $outcome = UserWalletRecord::find()->where('event_type = 10 and pay_type = 1 and wallet_type = 1')->sum('amount');
            $outcome = $outcome === null ? 0 : $outcome;
            $income_agency =  UserWalletRecord::find()->where('event_type=8 && pay_type=2 and wallet_type=1')->sum('amount');          //手续费收入

SELECT * FROM `me_zodiac` WHERE is_show = 1 ORDER BY `id` DESC
---
            //初始化变量
            $list = [];
            //获取所有宠物
            $zodiac = Zodiac::find()->where('is_show = 1')->orderBy('id desc')->asArray()->all();

SELECT * FROM `me_zodiac_apply` WHERE zodiac_id = '7' and created_at >= 1583164800
SELECT * FROM `me_user_zodiac` WHERE zodiac_id = '7' and over_time >= 1583164800 and over_time <= 1583251199 and source = 0
---
                foreach ($zodiac as $k => $v) {
                    // 获取今日预约数
                    $zodiac_apply = ZodiacApply::find()->where('zodiac_id = :zodiac_id and created_at >= :time',[':zodiac_id'=>$v['id'],':time'=>$beginToday]);
                    $yuyue_num = count($zodiac_apply->all());
                    // 获取今日到期数量(只有抢购获得的)
                    $userzodiac = UserZodiac::find()->where('zodiac_id = :id and over_time >= :begin and over_time <= :end and source = 0',
                        [':begin'=>$beginToday,':end'=>$endToday,':id'=>$v['id']])->all();

SELECT * FROM `me_snap_judgment` WHERE updated_at >= 1583164800 and status = 1 and zodiacid = '7'
---
//                        }
//                    }

                    $success =SnapJudgment::find()->where('updated_at >= :updated_at and status = 1 and zodiacid = :zodiacid',[':updated_at'=>$beginToday,':zodiacid'=>$v['id']])->all();

SELECT * FROM `me_snap_judgment` WHERE updated_at >= 1583164800 and status = 2 and zodiacid = '7'
SELECT COUNT(*) FROM `me_zodiac_issue` WHERE zodiac_id = '7' and issel = 0
---
                    // 今日抢购失败数量
//                    $failed_num = $v['kill_num'] - $success_num;

                    $failed = SnapJudgment::find()->where('updated_at >= :updated_at and status = 2 and zodiacid = :zodiacid',[':updated_at'=>$beginToday,':zodiacid'=>$v['id']])->all();
                    $failed_num = count($failed);
                    //宠物总数(未匹配的)
                    $zodiac_num = ZodiacIssue::find()->where('zodiac_id = :zodiac_id and issel = 0',[':zodiac_id'=>$v['id']])->count();