【零号基地90】华登区块狗运营级/2003291/app/backend/controllers/ZodiacController.php

    public function actionAjaxuserzodiac() {
        $res = UserZodiac::getList();
        $temp = ["total" => $res["total"], "rows" => []];
        if ($res["total"] > 0) {
            foreach ($res["data"] as $item) {
                $zodiac = Zodiac::findOne($item["zodiac_id"]);
                //获取发行表对应信息
                $issue = ZodiacIssue::findOne($item['issue_id']);
---
SELECT * FROM `me_zodiac` WHERE `id`='1'
SELECT * FROM `me_zodiac_issue` WHERE `id`='3'

    public function actionAjaxreleaselist() {
        $res = ZodiacIssue::getList();

        $temp = ["total" => $res["total"], "rows" => []];
        if ($res["total"] > 0) {
            foreach ($res["data"] as $item) {
                $zodiac = Zodiac::findOne($item['zodiac_id']);
---
SELECT * FROM `me_zodiac` WHERE `id`=4

    public function actionDeleteuserzodiac(){
        $id = Yii::$app->request->get('id');
        $user_zodiac = UserZodiac::findOne($id);    //获取当前用户宠物信息
        $zodiac_issue = ZodiacIssue::find()->where('id = :id',[':id'=>$user_zodiac->issue_id])->one();  //获取该宠物发行信息
        //更改允许上架的状态
        $user_zodiac->allow_rack = 1;
        //插入管理员日志
        $ac_log = \common\models\Actionlog::setLog('删除宠物：'.$id);
        //只有已过期(已上架)的宠物才能进行redis操作
        if($user_zodiac->is_overtime && $user_zodiac->is_rack){
            $zodiac_issue->issel = 3;   //限制出售
            if($user_zodiac->save() && $ac_log && $zodiac_issue->save()){
                Yii::$app->redis->lpop('zodiac_issue:'.$zodiac_issue->zodiac_id);   //缓存数量减少一个

                $redis_num = count(Yii::$app->redis->lrange("zodiac_issue:".$zodiac_issue->zodiac_id,0,-1));

                file_put_contents('../runtime/logs/redis_log.txt', '时间：'.time().'，后台删除用户宠物'.$zodiac_issue->zodiac_id.'子，发行ID:'.$zodiac_issue->id.'num:'.$redis_num.PHP_EOL,FILE_APPEND);
                Yii::$app->getSession()->setFlash('success', '删除成功');
            }else{
                Yii::$app->getSession()->setFlash('error', '删除失败');
            }
        }else{
            if($user_zodiac->save() && $ac_log){
---
SELECT * FROM `me_user_zodiac` WHERE `id`='3'
SELECT * FROM `me_zodiac_issue` WHERE id = 3
UPDATE `me_user_zodiac` SET `allow_rack`=1 WHERE `id`=3