【零号基地90】华登区块狗运营级/2003291/app/backend/views/regist/list.php

        </div>
<!--        会员等级-->
        <div class="form-group">
            <?php echo yii\helpers\Html::dropDownList("grade_id", null, yii\helpers\ArrayHelper::merge(["" => "会员等级"], yii\helpers\ArrayHelper::map(common\models\Grade::find()->asArray()->all(), "id", "name")), ["class" => "selectpicker"]); ?>
        </div>
<!--        LKC等级-->
        <div class="form-group">
            <?php echo yii\helpers\Html::dropDownList("level_id", null, yii\helpers\ArrayHelper::merge(["" => "请选择静态收益等级"], yii\helpers\ArrayHelper::map(backend\models\MY_Level::find()->asArray()->all(), "id", "name")), ["class" => "selectpicker"]); ?>
---
SELECT * FROM `me_grade`
SELECT * FROM `me_level`