【零号基地90】华登区块狗运营级/2003291/app/common/components/BController.php

    public function beforeAction($action) {
        if(parent::beforeAction($action)){
            $admin = \backend\models\MY_Admin::find()->where("id=:userid", [":userid" => Yii::$app->user->id])->one();
---
SELECT * FROM `me_admin` WHERE id=13