【零号基地90】华登区块狗运营级/2003291/app/common/components/OperateEvent.php

SELECT * FROM `me_level` WHERE `id`=1
SELECT * FROM `me_user_profile` WHERE `userid`=58
SELECT * FROM `me_user` WHERE id='58'
---
    protected function getUser($userid) {
        $result = \backend\models\MY_User::find()->where("id=:userid", [":userid" => $userid])->with(["userprofile", "wallet", "level"])->one();

INSERT INTO `me_user_wallet_record` (`userid`, `amount`, `event_type`, `pay_type`, `wallet_type`, `wallet_amount`, `note`, `created_at`, `ip`, `branch_id`, `updated_at`) VALUES (58, '1001', 1, 1, 3, '1001', '平台拨发推荐收益(1001)', 1583237602, '113.86.206.67', 0, 1583237602)
---
    public function sysCare() {
        $trans = Yii::$app->db->beginTransaction();
        $ip = Yii::$app->getRequest()->getUserIP();
        try {
            foreach ($this->ids as $id) {
                $user = $this->getUser($id);
                if ($user->iseal > 0) {
                    $this->sender->message = "您选择的会员存在被封会员，请仔细选择";
                    return false;
                }
                if ($this->amount <= 0) {
                    $this->sender->message = "金额必须大于0";
                    return false;
                }

                $user->wallet->care_wa = $user->wallet->care_wa + $this->amount;
                $model = new \frontend\models\WB_UserWalletRecord();
                $model->userid = $user->id;
                $model->amount = $this->amount;
                $model->event_type = 1;
                $model->pay_type = 1;
                $model->wallet_type = 3;
                $model->wallet_amount = $user->wallet->care_wa;
                $model->note = "平台拨发推荐收益({$this->amount})";
                $model->created_at = time();
                $model->ip = $ip;
                $model->branch_id = $user->branch_id;
                \common\models\Actionlog::setLog('拨发会员：'.$user->username.' '.$this->amount.' 推荐收益');
                if ($model->save() && $user->wallet->update()) {