【零号基地90】华登区块狗运营级/2003291/app/backend/models/MY_Admin.php

SELECT * FROM `me_admin` WHERE id != 8 ORDER BY `created_at` DESC LIMIT 10
---
    public static function getList() {
//        ->where("id != 8")
        $query = MY_Admin::find()->where("id != 8")->orderBy("created_at desc");
        $countQuery = clone $query;
        $offset = Yii::$app->request->get("offset");
        $limit = Yii::$app->request->get("limit");
        $totalCount = $countQuery->count();
        $res = $query->offset($offset)->limit($limit)->asArray()->all();