【零号基地90】华登区块狗运营级/2003291/app/backend/models/MY_IssueForm.php

    public function checkZodiac($attr, $params) {
        $zodiac = Zodiac::find()->where('id=:id', [':id' => $this->zodiac_id])->one();
---
SELECT * FROM `me_zodiac` WHERE id='5'

    public function checkHcg($attr, $params) {
        $zodiac = Zodiac::find()->where('id=:id', [':id' => $this->zodiac_id])->one();
        if($this->hcg < $zodiac->hcg_min || $this->hcg > $zodiac->hcg_max){
            $this->addError($attr, "宠物价格不在要发行的宠物区间范围内");
        }
        //获取用户钱包
        $userwallet = UserWallet::find()->where('userid = :id',[':id'=>$this->belong])->one();
---
SELECT * FROM `me_zodiac` WHERE id='5'
SELECT * FROM `me_user_wallet` WHERE userid = '58'

    public function checkUser($attr, $params) {
        $userdata = \common\models\User::find()->where('id=:id', [':id' => $this->belong])->one();
        if(empty($userdata)){
            $this->addError($attr, "没找到该用户");
        }
        $userbank = UserBank::find()->where('userid = :userid and state = 1',[':userid' => $userdata->id])->one();
---
SELECT * FROM `me_user` WHERE id='58'
SELECT * FROM `me_user_bank` WHERE userid = 58 and state = 1

    public static function createData() {
        $model = new MY_IssueForm();
        $model->load(Yii::$app->request->post());
        //验证表单数据
        if (!$model->validate()) {
            return ["errors" => $model->errors, "model" => $model];
        }
        //获取要发行的宠物
        $zodiac = Zodiac::findOne($model->zodiac_id);
        $userdata = \common\models\User::findOne($model->belong);
        $trans = Yii::$app->db->beginTransaction();
        try {
            for ($i=1;$i<=$model->num;$i++){
                //批量插入发行表
                $zodiacissue = new ZodiacIssue();
                $zodiacissue->zodiac_id = $model->zodiac_id;
                $zodiacissue->zodiac_name = $zodiac->name;
                $zodiacissue->hcg = $model->hcg;
                $zodiacissue->issel = 0;
                $zodiacissue->cash = $zodiac->cash;
                $zodiacissue->created_at = time();
                $zodiacissue->updated_at = time();
                $zodiacissue->belong_id = $model->belong;
                if(!$zodiacissue->save()){
---
SELECT * FROM `me_zodiac` WHERE `id`='5'
SELECT * FROM `me_user` WHERE `id`='58'
INSERT INTO `me_zodiac_issue` (`zodiac_id`, `zodiac_name`, `hcg`, `issel`, `cash`, `created_at`, `updated_at`, `belong_id`) VALUES (5, '生肖幸运狗', '1001', 0, '30', 1583237620, 1583237620, 58)

                $zodiacUser->allow_rack = 0;
                //宠物列表发行数增加
                $zodiac->issue_num += 1;
                $zodiac->save();
---
UPDATE `me_zodiac` SET `issue_num`=1 WHERE `id`=5

                $userdata->wallet->care_wa -= $model->hcg;
                $note = '后台发布宠物,扣除推广收益';
                UserWalletRecord::insertrecord($model->belong,$model->hcg,11,2,3,$userdata->wallet->care_wa,$note);
                if(!$zodiacUser->save() || !$userdata->wallet->save()){
---
UPDATE `me_user_wallet` SET `care_wa`='0' WHERE `id`=3