【零号基地90】华登区块狗运营级/2003291/app/backend/models/MY_Mgmt.php

SELECT * FROM `me_mgmt` WHERE ismenu=1 ORDER BY `sortid` DESC
---
    public static function getMenuData() {
        $data = MY_Mgmt::find()->where("ismenu=1")->orderBy("sortid desc")->asArray()->all();

SELECT * FROM `me_mgmt` WHERE name ='release_zodiac' and controller='Zodiac'
---
    public static function setActivePlace($route) {
        $shorttype = 0;
        if ($route && Yii::$app->defaultRoute !== $route) {
            list($controller, $action) = explode("/", $route);
            $condition = "name ='$action' and controller='" . ucfirst($controller) . "'";
            $model = MY_Mgmt::find()->where($condition)->one();

SELECT * FROM `me_mgmt` WHERE isallowed=1
---
    public static function getPublicFunctions() {
        $res = MY_Mgmt::find()->where("isallowed=1")->asArray()->all();