【零号基地90】华登区块狗运营级/2003291/app/backend/models/MY_Permission.php

    public static function getAdministratorPrivileges($id) {
        //非公共权限
        $query = (new Query())->select("*")->from(MY_Permission::tableName())->where("find_in_set(id,(select authids from me_admin where id={$id}))")->all();
---
SELECT * FROM `me_permission` WHERE find_in_set(id,(select authids from me_admin where id=13))